// 차트바 


var ctx = document.getElementById('myChart').getContext('2d');
		var myChart = new Chart(ctx, {
			type: 'bar',
			data: {
				labels: ['1월', '2월', '3월', '4월', '5월', '6월', '7월', '8월', '9월', '10월', '11월', '12월' ],
				datasets: [{
					label: '예측',
					data: [12, 18, 18, 19, 20, 22, 23, 24, 25, 15, 12, 10],
					backgroundColor: [
						'rgba(255, 200, 132, 0.2)',
						'rgba(255, 200, 132, 0.2)',
						'rgba(255, 200, 132, 0.2)',
						'rgba(255, 200, 132, 0.2)',
						'rgba(255, 200, 132, 0.2)',
						'rgba(255, 200, 132, 0.2)',
						'rgba(255, 200, 132, 0.2)',
						'rgba(255, 200, 132, 0.2)',
						'rgba(255, 200, 132, 0.2)',
						'rgba(255, 200, 132, 0.2)',
						'rgba(255, 200, 132, 0.2)',
						'rgba(255, 200, 132, 0.2)',

						
					],
					borderColor: [
						'rgba(255, 99, 132, 1)',
						'rgba(255, 99, 132, 1)',
						'rgba(255, 99, 132, 1)',
						'rgba(255, 99, 132, 1)',
						'rgba(255, 99, 132, 1)',
						'rgba(255, 99, 132, 1)',
						'rgba(255, 99, 132, 1)',
						'rgba(255, 99, 132, 1)',
						'rgba(255, 99, 132, 1)',
						'rgba(255, 99, 132, 1)',
						'rgba(255, 99, 132, 1)',
						'rgba(255, 99, 132, 1)',
						
					],
					borderWidth: 1
				}, 
				
				{ 
					label: '출고량',
					data: [12, 19, 16, 20, 18, 24, 25, 21, 27, 16, 10, 12],
					
					backgroundColor: [
						'rgba(75, 137, 220, 0.2)',
						'rgba(75, 137, 220, 0.2)',
						'rgba(75, 137, 220, 0.2)',
						'rgba(75, 137, 220, 0.2)',
						'rgba(75, 137, 220, 0.2)',
						'rgba(75, 137, 220, 0.2)',
						'rgba(75, 137, 220, 0.2)',
						'rgba(75, 137, 220, 0.2)',
						'rgba(75, 137, 220, 0.2)',
						'rgba(75, 137, 220, 0.2)',
						'rgba(75, 137, 220, 0.2)',
						'rgba(75, 137, 220, 0.2)',
						
					],
					borderColor: [
						'rgba(75, 137, 220, 1)',
						'rgba(75, 137, 220, 1)',
						'rgba(75, 137, 220, 1)',
						'rgba(75, 137, 220, 1)',
						'rgba(75, 137, 220, 1)',
						'rgba(75, 137, 220, 1)',
						'rgba(75, 137, 220, 1)',
						'rgba(75, 137, 220, 1)',
						'rgba(75, 137, 220, 1)',
						'rgba(75, 137, 220, 1)',
						'rgba(75, 137, 220, 1)',
						'rgba(75, 137, 220, 1)',
						
					],
					borderWidth: 1

				},



				// {
				// 	label: 'Line Dataset',
				// 	data:[10,2,3,5,7],
				// 	type:'line',
				// 	order:2

				// }


					
				]
			},
			options: {
				scales: {
					yAxes: [{

						gridLines:{
							offsetGridLines : true
						},

						ticks: {
							beginAtZero: true
						}
					}]
				}
			}
		});